cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birthdate", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["birthdate", "2018-09-01"], ["color", "green"], ["name", "test"], ["sex", "F"], ["description", "afda"], ["created_at", "2018-09-11 21:37:30.343826"], ["updated_at", "2018-09-11 21:37:30.343826"]]
---
  def create
    cat = Cat.new(cat_params)
    if cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["sex", "M"], ["updated_at", "2018-09-11 22:26:33.787273"], ["id", 6]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]
---
  def destroy
     cat = Cat.find(params[:id])
    if cat.destroy